{"_name_or_path": "sergeyzh/rubert-mini-sts", "architectures": ["BertForTokenClassification"], "attention_probs_dropout_prob": 0.1, "classifier_dropout": null, "emb_size": 312, "gradient_checkpointing": false, "hidden_act": "gelu", "hidden_dropout_prob": 0.1, "hidden_size": 312, "id2label": {"0": "O", "1": "I-value", "2": "B-value", "3": "B-discount"}, "initializer_range": 0.02, "intermediate_size": 600, "label2id": {"O": "0", "I-value": "1", "B-value": "2", "B-discount": "3"}, "layer_norm_eps": 1e-12, "max_position_embeddings": 2048, "model_type": "bert", "num_attention_heads": 12, "num_hidden_layers": 7, "pad_token_id": 0, "position_embedding_type": "absolute", "torch_dtype": "float32", "transformers_version": "4.41.2", "type_vocab_size": 2, "use_cache": true, "vocab_size": 83828}